MasteringDataAlgoCpp/LINKED_LIST/linkedlist.org
#+TITLE:Linkedlist Operations (Singly and Doubly)
#+DATE:{{{time(%A %d-%m-%Y)}}} 
#+LATEX_HEADER: \author{Max Le}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{minted}
* Theory
** Array vs Linkedlist
*** Array
**** fixed size
**** create on stack e.g. int A[5]
**** create on heap e.g. int *p = new int[5];
*** Linkedlist
**** Allocate memories in node:  pointer to current elemen | pointer to next element
**** Create on heap
** LinkedList basic
*** collections of nodes, each node has "Data" + "Pointer to next Node"
*** "Head" points to first node 
*** Addresses may not be side by side, unlike array
*** To create a node, need: DATA and POINTER to a NODE (NODE type)
*** A node structure:  DATA | NEXT
*** For C language:
    #+ATTR_LATEX: :options frame=single
    #+begin_src C 
      struct Node
      {
	int data;
	struct Node *next;		/* self referential structure */
      };

      int main(){
	struct Node *p;
	p = (struct Node*)malloc(sizeof(struct Node));
	/* For C++ */
	/* p = new Node */


	p->data = 10; 		/* assign 10 to DATA */
	p->next = 0;			/* or NULL, meaning next pointer points to nothing */

	return 0;
      }
    #+end_src
*** How to display a linkedlist
**** Iterative
     #+ATTR_LATEX: :options frame=single
     #+begin_src C 
       struct Node *p = first;		/* set a pointer to point to first node */

       while (p != 0) {
	 printf("%d\n", p->data);	/* print the data */
	 p = p ->next;			/* move p to next node */
	}
     #+end_src
**** Recursive
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       void displayRecursive(struct Node *p){
	 if (p != NULL) {
	   printf("%d\n", p->data);
	   displayRecursive(p->next);
	 }
       }
     #+end_src
** Singular Linked List
*** How to count node in linked list
**** Iterative
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* taking O(n) time and O(1) space */
       int count(struct Node *p){
	 int c = 0;
	 while (p != NULL) {
	   c++;
	   p = p->next
	     }
	 return c;
       }
     #+end_src
**** Recursive
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Time O(n) Space O(n) */
       int count (struct Node *p){
	 if (p == NULL) {
	   return 0;
	 }
	 else {
	   return count(p->next) + 1;
	 }
       }
     #+end_src
*** How to sum all elements in linked list
**** Iterative
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Time O(n) Space O(1)*/
       int Add(struct Node *p){
	 int sum = 0;
	 while (p != NULL) {
	   sum = sum + p->data;
	   p=p->next;
	 }
	 return sum;
       }
     #+end_src
**** Recursion
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Time, Space O(n) */
       int Add(struct Node *p){
	 if (p == NULL) {
	   return 0;
	 }
	 else {
	   return Add(p->next)+p->data;
	 }
       }
     #+end_src
*** Find max element in linked list
**** Iterative 
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       int max(struct Node *p){
	 int m = -32768;		/* min integer */
	 while (p != NULL) {
	   if (p->data > m) {
	     m = p->data;
	   }
	   p = p->next;
	 }
	 return m;
       }
     #+end_src
**** Recursive
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       int max(struct Node *p){

	 int x = 0;

	 if (p == NULL) {
	   return MIN_INT;
	 }
	 else {
	   x = max(p->next);
	   if (x > p->data) {
	     return x;
	   }
	   else {
	     return p->data;
	   }
	 }
       }
     #+end_src

     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       int max(struct Node *p){
	 int x = 0;
	 if (p == 0) {
	   return MIN_INT;
	 }
	 x = max(p->next);
	 return x > p->data ? x : p->data;
       }
     #+end_src
*** Searching (linear search)
**** Iterative
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       Node *search (struct Node *p, int key){
	 while (p != NULL) {
	   if (key == p->data) {
	     return(p);
	   }
	   p = p->next;
	 }
	 return NULL;
       }
     #+end_src
**** Recursive
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       Node *search(struct Node *p, int key){
	 if (p == NULL) {
	   return NULL;
	 }

	 if (key == p->data) {
	   return p;
	 }

	 return search(p->next, key);
       }
     #+end_src
**** Move found to head 
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       Node *search(struct Node *p, int key){
	 Node *q = NULL; 		/* previous pointer */

	 while (p != NULL) {
	   if (key == p->data) {
	     q->next = p->next;
	     p->next = first;
	     first = p;
	   }
	   q = p;
	   p = p->next;
	 }
       }
     #+end_src
*** Inserting
**** Insert *BEFORE* first node
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* constant time */
       Node *t = new Node; 		/* create new node */
       t->data = x; 			/* assign new node data */
       t->next = first; 		/* t points to first pointer, making t comes before first */
       first = t; 			/* old "first" point to t , t is now first */
     #+end_src
**** Insert *AFTER* given position
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* insert between left and right node */
       /* O(N) max time, O(1) min time */
       Node *t = new Node;
       t->data = x;
       p = first; 			/* start temporary pointer from first */
       pos = 4; 			/* position to insert after */

       /* moving p till reach left node */
       for (i = 0; i < pos-1 ; i++) {
	 p = p->next;
	}

       t->next = p->next;		/* t next pointer points to the right node */
       p->next = t; 			/* p->next points to t, so t is between left and right */


     #+end_src
**** Combine
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       void Insert (int pos, int x){
	 Node *t, *p;
	 if (pos == 0) {
	   t = new Node;
	   t->data = x;
	   t->next = first;
	   first = t;
	 }
	 else if (pos > 0) {
	   p = first;
	   for (i = 0; i < pos-1 && p != NULL ; i++) {
	     p = p->next;
	   }

	   if (p != NULL) {
	     t = new Node;
	     t->data = x;
	     t->next = p->next;
	     p->next = t;
	   }
	 }
       }
     #+end_src
**** Special case: Insert at last only
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       void InsertLast(int x){
	 Node *t = new Node;
	 t->data = x;
	 t->next = NULL;

	 /* no node in list */
	 if (first == NULL) {
	   first = last = t;
	 }
	 else {
	   last->next = t;
	   last = t;
	 }
       }
     #+end_src
**** Insert in a *SORTED* linked list, at a *SORTED* position
     #+ATTR_LATEX: :options frame=single
     #+begin_src C 
       /* Time: min O(1) max O(n) */
       p = first;
       q = NULL;

       while (p != NULL && p->data < x) {
	 q = p;
	 p = p->next;
	}

       t = new Node;
       t->data = x;
       t->next = q->next;
       q->next = t;
     #+end_src
*** Deleting
**** Delete first node
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Time O(1)  */
       Node *p = first;		/* arbitray pointer p poins to first */
       first=first->next;		/* move first to point to next node */
       delete p; 			/* delete the original first */

     #+end_src
