MasteringDataAlgoCpp/LINKED_LIST/linkedlist.tex
% Created 2021-08-23 Mon 19:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Max Le}
\usepackage{hyperref}
\usepackage{minted}
\date{Monday 23-08-2021}
\title{Linkedlist Operations (Singly and Doubly)}
\hypersetup{
 pdfauthor={},
 pdftitle={Linkedlist Operations (Singly and Doubly)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Theory}
\label{sec:org2c4f776}
\subsection{Array vs Linkedlist}
\label{sec:org22100f3}
\subsubsection{Array}
\label{sec:org6e78577}
\begin{enumerate}
\item fixed size
\label{sec:org35ee98f}
\item create on stack e.g. int A[5]
\label{sec:org8db9558}
\item create on heap e.g. int *p = new int[5];
\label{sec:orgf35d1b9}
\end{enumerate}
\subsubsection{Linkedlist}
\label{sec:org3eb3ade}
\begin{enumerate}
\item Allocate memories in node:  pointer to current elemen | pointer to next element
\label{sec:org86c30cd}
\item Create on heap
\label{sec:org255dfd1}
\end{enumerate}
\subsection{LinkedList basic}
\label{sec:org16cc2ea}
\subsubsection{collections of nodes, each node has "Data" + "Pointer to next Node"}
\label{sec:org5bffec8}
\subsubsection{"Head" points to first node}
\label{sec:org2119e0b}
\subsubsection{Addresses may not be side by side, unlike array}
\label{sec:org676240a}
\subsubsection{To create a node, need: DATA and POINTER to a NODE (NODE type)}
\label{sec:orga64cc7c}
\subsubsection{A node structure:  DATA | NEXT}
\label{sec:org759fac9}
\subsubsection{For C language:}
\label{sec:orgaa80c08}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
struct Node
{
  int data;
  struct Node *next;		/* self referential structure */
};

int main(){
  struct Node *p;
  p = (struct Node*)malloc(sizeof(struct Node));
  /* For C++ */
  /* p = new Node */


  p->data = 10; 		/* assign 10 to DATA */
  p->next = 0;			/* or NULL, meaning next pointer points to nothing */

  return 0;
}
\end{minted}
\subsubsection{How to display a linkedlist}
\label{sec:org228e0a4}
\begin{enumerate}
\item Iterative
\label{sec:orgbf3fab7}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
struct Node *p = first;		/* set a pointer to point to first node */

while (p != 0) {
  printf("%d\n", p->data);	/* print the data */
  p = p ->next;			/* move p to next node */
 }
\end{minted}
\item Recursive
\label{sec:orgd9f2015}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void displayRecursive(struct Node *p){
  if (p != NULL) {
    printf("%d\n", p->data);
    displayRecursive(p->next);
  }
}
\end{minted}
\end{enumerate}
\subsection{Singular Linked List}
\label{sec:org8bf64d3}
\subsubsection{How to count node in linked list}
\label{sec:orga1bb46f}
\begin{enumerate}
\item Iterative
\label{sec:org22c11e3}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* taking O(n) time and O(1) space */
int count(struct Node *p){
  int c = 0;
  while (p != NULL) {
    c++;
    p = p->next
      }
  return c;
}
\end{minted}
\item Recursive
\label{sec:orgb5d6338}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time O(n) Space O(n) */
int count (struct Node *p){
  if (p == NULL) {
    return 0;
  }
  else {
    return count(p->next) + 1;
  }
}
\end{minted}
\end{enumerate}
\subsubsection{How to sum all elements in linked list}
\label{sec:org5ac90c8}
\begin{enumerate}
\item Iterative
\label{sec:orgca801e5}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time O(n) Space O(1)*/
int Add(struct Node *p){
  int sum = 0;
  while (p != NULL) {
    sum = sum + p->data;
    p=p->next;
  }
  return sum;
}
\end{minted}
\item Recursion
\label{sec:org56329fe}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time, Space O(n) */
int Add(struct Node *p){
  if (p == NULL) {
    return 0;
  }
  else {
    return Add(p->next)+p->data;
  }
}
\end{minted}
\end{enumerate}
\subsubsection{Find max element in linked list}
\label{sec:orgc144fd7}
\begin{enumerate}
\item Iterative
\label{sec:orgeda1ce8}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
int max(struct Node *p){
  int m = -32768;		/* min integer */
  while (p != NULL) {
    if (p->data > m) {
      m = p->data;
    }
    p = p->next;
  }
  return m;
}
\end{minted}
\item Recursive
\label{sec:org25205d1}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
int max(struct Node *p){

  int x = 0;

  if (p == NULL) {
    return MIN_INT;
  }
  else {
    x = max(p->next);
    if (x > p->data) {
      return x;
    }
    else {
      return p->data;
    }
  }
}
\end{minted}

\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
int max(struct Node *p){
  int x = 0;
  if (p == 0) {
    return MIN_INT;
  }
  x = max(p->next);
  return x > p->data ? x : p->data;
}
\end{minted}
\end{enumerate}
\subsubsection{Searching (linear search)}
\label{sec:orgdce38ed}
\begin{enumerate}
\item Iterative
\label{sec:org698320f}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *search (struct Node *p, int key){
  while (p != NULL) {
    if (key == p->data) {
      return(p);
    }
    p = p->next;
  }
  return NULL;
}
\end{minted}
\item Recursive
\label{sec:org27a09e6}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *search(struct Node *p, int key){
  if (p == NULL) {
    return NULL;
  }

  if (key == p->data) {
    return p;
  }

  return search(p->next, key);
}
\end{minted}
\item Move found to head
\label{sec:orged35049}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *search(struct Node *p, int key){
  Node *q = NULL; 		/* previous pointer */

  while (p != NULL) {
    if (key == p->data) {
      q->next = p->next;
      p->next = first;
      first = p;
    }
    q = p;
    p = p->next;
  }
}
\end{minted}
\end{enumerate}
\subsubsection{Inserting}
\label{sec:org7da9388}
\begin{enumerate}
\item Insert \textbf{BEFORE} first node
\label{sec:org1e3d18a}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* constant time */
Node *t = new Node; 		/* create new node */
t->data = x; 			/* assign new node data */
t->next = first; 		/* t points to first pointer, making t comes before first */
first = t; 			/* old "first" point to t , t is now first */
\end{minted}
\item Insert \textbf{AFTER} given position
\label{sec:orgef085c9}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* insert between left and right node */
/* O(N) max time, O(1) min time */
Node *t = new Node;
t->data = x;
p = first; 			/* start temporary pointer from first */
pos = 4; 			/* position to insert after */

/* moving p till reach left node */
for (i = 0; i < pos-1 ; i++) {
  p = p->next;
 }

t->next = p->next;		/* t next pointer points to the right node */
p->next = t; 			/* p->next points to t, so t is between left and right */


\end{minted}
\item Combine
\label{sec:org4bf0b5e}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void Insert (int pos, int x){
  Node *t, *p;
  if (pos == 0) {
    t = new Node;
    t->data = x;
    t->next = first;
    first = t;
  }
  else if (pos > 0) {
    p = first;
    for (i = 0; i < pos-1 && p != NULL ; i++) {
      p = p->next;
    }

    if (p != NULL) {
      t = new Node;
      t->data = x;
      t->next = p->next;
      p->next = t;
    }
  }
}
\end{minted}
\item Special case: Insert at last only
\label{sec:orgc09ddd1}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void InsertLast(int x){
  Node *t = new Node;
  t->data = x;
  t->next = NULL;

  /* no node in list */
  if (first == NULL) {
    first = last = t;
  }
  else {
    last->next = t;
    last = t;
  }
}
\end{minted}
\item Insert in a \textbf{SORTED} linked list, at a \textbf{SORTED} position
\label{sec:org91552df}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time: min O(1) max O(n) */
p = first;
q = NULL;

while (p != NULL && p->data < x) {
  q = p;
  p = p->next;
 }

t = new Node;
t->data = x;
t->next = q->next;
q->next = t;
\end{minted}
\end{enumerate}
\subsubsection{Deleting}
\label{sec:org2acb104}
\begin{enumerate}
\item Delete first node
\label{sec:org915a5e4}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time O(1)  */
Node *p = first;		/* arbitray pointer p poins to first */
first=first->next;		/* move first to point to next node */
delete p; 			/* delete the original first */

\end{minted}
