MasteringDataAlgoCpp/LINKED_LIST/linkedlist.org
**** Delete at given position
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Time min O(1) max O(n) */
       Node *p = first;
       Node *q = NULL;

       for (i = 0; i < pos-1 ; i++) {
	 q = p;
	 p = p->next;
	}

       q->next = p->next;
       delete p;

     #+end_src
*** Check if linkedlist is sorted
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      /* Time O(n) max O(1) min */
      int x = -32768;
      Node *p = first;

      while (p != NULL) {
	if (p->data < x) {
	  return false;
	}
	x = p->data;
	p = p->next;
       }
      return true;
    #+end_src
*** Remove duplicate 
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      Node *p = first;
      Node *q = first->next;
      while (q != NULL) {
	if (p->data != q->data) {
	  p = q;
	  q = q->next;
	}
	else {
	  p->next = q->next;
	  delete q;
	  q = p->next;
	}
       }
    #+end_src

*** Reverse a linkedlist 
**** Interchange elements
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       p = first;
       i = 0;
       /* Copy to extra array */
       while (p != NULL) {
	 A[i] = p->data;
	 p = p->next;
	 i++;
	}
       p = first;
       i--;

       /* Reverse copy back to list */
       while (p != NULL) {
	 p->data = A[i];
	 i--;
	 p = p->next;
	}
     #+end_src
**** Reversing links
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* Setup 3 sliding pointers */
       p = first;
       q = NULL;
       r = NULL;

       while (p != NULL) {
	 r = q;
	 q = p;
	 p = p->next;

	 q->next = r;
	}

       /* Update first */
       first = q;
     #+end_src
**** Recursion
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       void Reverse(Node *q, Node *p){
	 if (p != NULL) {
	   Reverse(p, p->next);
	   p->next = q;
	 }
	 else {
	   first = q;

	 }
       }
     #+end_src

*** Joining/Append 2 linked list
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      p = first;

      /* traverse till the last node and stop */
      while (p->next != NULL) {
	p = p->next;
       }

      p->next = second; 		/* point last node to first node of the other list */
      second = NULL; 			/* delete/free/NULL the extra pointer */
    #+end_src
*** Merging 2 linkedlist
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      /* Create 2 pointers for the merged list */
      Node *third, *last;

      /* First loop */
      if (first->data < second->data) {
	third = last = first;
	first = first->next;
	last->next = NULL;
       }
       else {
	 third=last=second;
	 second = second->next;
	 last->next = NULL;
       }

      while (first != NULL && second != NULL) {
	if (first->data < second->data) {
	  last->next = first;
	  last = first;
	  first = first->next;
	  last->next = NULL;
	}
	else {
	  last->next = second;
	  last = second;
	  second = second->next;
	  last->next = NULL;
	}
       }

      if (first != NULL) {
	last->next = first;
       }
       else {
	 last->next = second;
       }
    #+end_src
*** Check for LOOP in
**** LOOP: Last node points to some other nodes
**** LINEAR: Last node points to NULL
***** 
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	int isLoop(Node *first){
	  Node *p, *q;
	  p = q = first;
	  do
	    {
	      p = p-next;
	      q = q->next;
	      if (q != NULL) {
		q = q->next;
	      }
	      else {
		q = NULL;
	      }
	    } while (p != NULL && q != NULL);


	  if (p == q) {
	    return true;
	  }
	  else {
	    return false;
	  }


	}
      #+end_src
     
*** Circular linkedlist
**** Last node points to first node
**** or a collection of nodes that are circularly connected
**** Use HEAD instead of FIRST
**** Two representations:
***** HEAD/1st node -> 2nd node -> 3rd node -> 4th node -> back to HEAD/1st node  
***** HEAD -> 1st -> 2nd -> 3rd -> 4th -> back to 1st
**** How to display
***** Loop display 
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	void Display(Node *p){
	  do
	    {
	      printf("%d\n", p->data);
	      p = p->next;
	    } while (p != Head);

	}
      #+end_src
***** Recursive display
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	void Display(Node *p){
	  static int flag = 0;		/* so only 1 creation of int flag */
	  if (p != Head || flag = 0) {
	    flag = 1;
	    printf("%d\n", p->data);
	    Display(p->next);
	  }
	  flag = 0;
	}
      #+end_src
**** How to insert
***** After Head
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	Node *t;
	Node *p = Head;

	for (i = 0; i < pos-1 ; i++) {
	  p = p->next;
	 }

	t = new Node;
	t->data = x;
	t->next = p->next;
	p->next = t;
      #+end_src
***** Before Head
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	Node *t = new Node;
	t->data = x;
	t->next = Head;

	Node *p = Head;
	while (p->next != Head) {
	  p = p->next;
	 }

	p->next = t;
	Head = t;
      #+end_src
**** Delete
***** Delete from Given Position
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	p = Head;
	for (i = 0; i < pos-2 ; i++) {
	  p = p->next;
	 }

	q = p->next;
	p->next = q->next;
	x = q->data;
	delete q;

      #+end_src
***** Delete Head
      #+ATTR_LATEX: :options frame=single
      #+begin_src C
	p = Head;
	while (p->next != Head) {
	  p = p->next;
	 }

	p->next = Head->next;
	x = Head->data;
	delete Head;
	Head = p->next;
      #+end_src

** Doubly Linked List
*** a node has pointer to *NEXT* node and *PREVIOUS* node
*** Structure in C:
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      struct Node
      {
	struct Node *prev;
	int data;
	struct Node *next;
      };
    #+end_src
*** Insertion
**** Before first
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       Node *t = new Node;
       t->data = x;

       /* Modify links */
       t->prev = NULL;
       t->next = first;
       first->prev = t;

       /* Rename new first */
       first = t;
     #+end_src
**** After given index min O(1) max O(n)
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       Node *t = new Node;
       t->data = x;

       /* To reach the node before the insertion */
       for (i = 0; i < pos-1 ; i++) {
	 p = p->next
	   }

       /* Modify links */
       t->next = p->next;		/* inserted node should point to the node on the RIGHT (p->next) */
       t->prev = p;			/* inserted node should point to the node on the LEFT (p) */


       /* for node on the RIGHT, its prev must point to the inserted node */
       /* Must check if next is available, in case we insert at last then next is NULL */
       if (p->next ! =NULL) {
	 p->next->prev = t;
	}

       p->next = t; 			/* node on the LEFT should point to the inserted node */

     #+end_src
*** Delete
**** Delete 1st node
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       p = first;
       first = first->next;
       x = p->data;
       delete p;

       if (first != NULL) {
	 first->prev = NULL;
	}
     #+end_src
**** Delete from given index
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       /* bring a pointer p upon given index */
       p = first;

       for (i = 0; i < pos-1 ; i++) {
	 p = p->next;
	}

       p->prev->next = p->next; 	/* LEFT node points to RIGHT node, skip CURRENT */

       if (p->next != NULL) {		/* if RIGHT node exists */
	 p->next->prev = p->prev;  	/* RIGHT node points to LEFT node, skip CURRENT */
	}

       x = p->data;
       delete p;
     #+end_src
*** Reverse
**** Display
     #+ATTR_LATEX: :options frame=single
     #+begin_src C
       p = first;

       while (p != NULL) {
	 printf("%d\n", p->data);
	 p = p->next

	   }

     #+end_src
