MasteringDataAlgoCpp/LINKED_LIST/linkedlist.tex
\item Delete at given position
\label{sec:org07c3121}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time min O(1) max O(n) */
Node *p = first;
Node *q = NULL;

for (i = 0; i < pos-1 ; i++) {
  q = p;
  p = p->next;
 }

q->next = p->next;
delete p;

\end{minted}
\end{enumerate}
\subsubsection{Check if linkedlist is sorted}
\label{sec:orgc144797}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Time O(n) max O(1) min */
int x = -32768;
Node *p = first;

while (p != NULL) {
  if (p->data < x) {
    return false;
  }
  x = p->data;
  p = p->next;
 }
return true;
\end{minted}
\subsubsection{Remove duplicate}
\label{sec:org34ee537}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *p = first;
Node *q = first->next;
while (q != NULL) {
  if (p->data != q->data) {
    p = q;
    q = q->next;
  }
  else {
    p->next = q->next;
    delete q;
    q = p->next;
  }
 }
\end{minted}

\subsubsection{Reverse a linkedlist}
\label{sec:org9177f9d}
\begin{enumerate}
\item Interchange elements
\label{sec:org015edd2}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = first;
i = 0;
/* Copy to extra array */
while (p != NULL) {
  A[i] = p->data;
  p = p->next;
  i++;
 }
p = first;
i--;

/* Reverse copy back to list */
while (p != NULL) {
  p->data = A[i];
  i--;
  p = p->next;
 }
\end{minted}
\item Reversing links
\label{sec:orgb1cc34a}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Setup 3 sliding pointers */
p = first;
q = NULL;
r = NULL;

while (p != NULL) {
  r = q;
  q = p;
  p = p->next;

  q->next = r;
 }

/* Update first */
first = q;
\end{minted}
\item Recursion
\label{sec:orgf558d5a}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void Reverse(Node *q, Node *p){
  if (p != NULL) {
    Reverse(p, p->next);
    p->next = q;
  }
  else {
    first = q;

  }
}
\end{minted}
\end{enumerate}

\subsubsection{Joining/Append 2 linked list}
\label{sec:orgd1583a2}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = first;

/* traverse till the last node and stop */
while (p->next != NULL) {
  p = p->next;
 }

p->next = second; 		/* point last node to first node of the other list */
second = NULL; 			/* delete/free/NULL the extra pointer */
\end{minted}
\subsubsection{Merging 2 linkedlist}
\label{sec:orgce1c559}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* Create 2 pointers for the merged list */
Node *third, *last;

/* First loop */
if (first->data < second->data) {
  third = last = first;
  first = first->next;
  last->next = NULL;
 }
 else {
   third=last=second;
   second = second->next;
   last->next = NULL;
 }

while (first != NULL && second != NULL) {
  if (first->data < second->data) {
    last->next = first;
    last = first;
    first = first->next;
    last->next = NULL;
  }
  else {
    last->next = second;
    last = second;
    second = second->next;
    last->next = NULL;
  }
 }

if (first != NULL) {
  last->next = first;
 }
 else {
   last->next = second;
 }
\end{minted}
\subsubsection{Check for LOOP in}
\label{sec:orgf0ea99b}
\begin{enumerate}
\item LOOP: Last node points to some other nodes
\label{sec:orgb11365e}
\item LINEAR: Last node points to NULL
\label{sec:orgbc3f19d}
\begin{enumerate}
\item 
\label{sec:org2c7f655}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
int isLoop(Node *first){
  Node *p, *q;
  p = q = first;
  do
    {
      p = p-next;
      q = q->next;
      if (q != NULL) {
	q = q->next;
      }
      else {
	q = NULL;
      }
    } while (p != NULL && q != NULL);


  if (p == q) {
    return true;
  }
  else {
    return false;
  }


}
\end{minted}
\end{enumerate}
\end{enumerate}

\subsubsection{Circular linkedlist}
\label{sec:org33fd30e}
\begin{enumerate}
\item Last node points to first node
\label{sec:org8155811}
\item or a collection of nodes that are circularly connected
\label{sec:org9f1922e}
\item Use HEAD instead of FIRST
\label{sec:org88c449d}
\item Two representations:
\label{sec:org469194a}
\begin{enumerate}
\item HEAD/1st node -> 2nd node -> 3rd node -> 4th node -> back to HEAD/1st node
\label{sec:org261123c}
\item HEAD -> 1st -> 2nd -> 3rd -> 4th -> back to 1st
\label{sec:org78a90f3}
\end{enumerate}
\item How to display
\label{sec:org457afa6}
\begin{enumerate}
\item Loop display
\label{sec:org27c8afa}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void Display(Node *p){
  do
    {
      printf("%d\n", p->data);
      p = p->next;
    } while (p != Head);

}
\end{minted}
\item Recursive display
\label{sec:org51b426b}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
void Display(Node *p){
  static int flag = 0;		/* so only 1 creation of int flag */
  if (p != Head || flag = 0) {
    flag = 1;
    printf("%d\n", p->data);
    Display(p->next);
  }
  flag = 0;
}
\end{minted}
\end{enumerate}
\item How to insert
\label{sec:orgd6b1efb}
\begin{enumerate}
\item After Head
\label{sec:org156eb32}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *t;
Node *p = Head;

for (i = 0; i < pos-1 ; i++) {
  p = p->next;
 }

t = new Node;
t->data = x;
t->next = p->next;
p->next = t;
\end{minted}
\item Before Head
\label{sec:orgcf9bcda}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *t = new Node;
t->data = x;
t->next = Head;

Node *p = Head;
while (p->next != Head) {
  p = p->next;
 }

p->next = t;
Head = t;
\end{minted}
\end{enumerate}
\item Delete
\label{sec:org8ad2eb4}
\begin{enumerate}
\item Delete from Given Position
\label{sec:org41b2aa5}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = Head;
for (i = 0; i < pos-2 ; i++) {
  p = p->next;
 }

q = p->next;
p->next = q->next;
x = q->data;
delete q;

\end{minted}
\item Delete Head
\label{sec:org5b22c6c}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = Head;
while (p->next != Head) {
  p = p->next;
 }

p->next = Head->next;
x = Head->data;
delete Head;
Head = p->next;
\end{minted}
\end{enumerate}
\end{enumerate}

\subsection{Doubly Linked List}
\label{sec:orga847e2d}
\subsubsection{a node has pointer to \textbf{NEXT} node and \textbf{PREVIOUS} node}
\label{sec:org89f5d90}
\subsubsection{Structure in C:}
\label{sec:org9ff4653}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
struct Node
{
  struct Node *prev;
  int data;
  struct Node *next;
};
\end{minted}
\subsubsection{Insertion}
\label{sec:org4794d8f}
\begin{enumerate}
\item Before first
\label{sec:orgcf2327e}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *t = new Node;
t->data = x;

/* Modify links */
t->prev = NULL;
t->next = first;
first->prev = t;

/* Rename new first */
first = t;
\end{minted}
\item After given index min O(1) max O(n)
\label{sec:org6fd7cdc}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
Node *t = new Node;
t->data = x;

/* To reach the node before the insertion */
for (i = 0; i < pos-1 ; i++) {
  p = p->next
    }

/* Modify links */
t->next = p->next;		/* inserted node should point to the node on the RIGHT (p->next) */
t->prev = p;			/* inserted node should point to the node on the LEFT (p) */


/* for node on the RIGHT, its prev must point to the inserted node */
/* Must check if next is available, in case we insert at last then next is NULL */
if (p->next ! =NULL) {
  p->next->prev = t;
 }

p->next = t; 			/* node on the LEFT should point to the inserted node */

\end{minted}
\end{enumerate}
\subsubsection{Delete}
\label{sec:orgd4c97a1}
\begin{enumerate}
\item Delete 1st node
\label{sec:org6b46761}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = first;
first = first->next;
x = p->data;
delete p;

if (first != NULL) {
  first->prev = NULL;
 }
\end{minted}
\item Delete from given index
\label{sec:orgc0d7f7a}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
/* bring a pointer p upon given index */
p = first;

for (i = 0; i < pos-1 ; i++) {
  p = p->next;
 }

p->prev->next = p->next; 	/* LEFT node points to RIGHT node, skip CURRENT */

if (p->next != NULL) {		/* if RIGHT node exists */
  p->next->prev = p->prev;  	/* RIGHT node points to LEFT node, skip CURRENT */
 }

x = p->data;
delete p;
\end{minted}
\end{enumerate}
