MasteringDataAlgoCpp/LINKED_LIST/linkedlist.org
**** Reverse
     #+ATTR_LATEX: :options frame=single
     #+begin_src C 
       p = first;

       while (p != NULL) {
	 temp = p->next;
	 p->next = p->prev;
	 p->prev = temp;
	 p = p->prev;
	}

       /* for last node, bring first there */
       if (p!= NULL && p->next == NULL) {
	 first = p;
	}
     #+end_src
*** Circular
**** Insert
**** Display
* Comparing different linkedlists
** Space: Doubly takes double the amount of pointers in Singly
** Insert: constant time for Linear Singly, Linear Doubly, Circular Doubly.  Nth time for Circular Singly
* Array vs Linkedlist
** Creation: array in stack or heap, LL is always on heap
** Size: array fixed, LL can grow until heap is full
** LL takes extra space
** Array access directly (faster), LL access sequentially (slower)
** Data movement in array is more expensive
* Student challenge
** Find middle node of LL
*** 1st solution
**** find length of LL => say 7
**** reach middle node => 7/2 ~ 4 
**** move the pointer 4-1 times
*** 2nd solution
**** use 2 pointers, 1 move 2 space, other move 1 space
*** 3rd solution
**** push each node to a stack
**** pop out the node at stack number floor(stack size / 2)
** Find intersection of 2 LL
*** Eg: LL1->LL3 and LL2->LL3 => Both LL1 and LL2 has LL3 as common. For example:
**** LL1: 8->6->3->9->10->4->2->12
**** LL2: 20->30->40->10->4->2->12 
*** We need to find the starting common point, i.e. block *10*?
**** We traverse the 1st LL or 2nd LL till the end.  
**** Then from end, we traverse back, if the previous block is different,
**** then current block is *intersection point*
**** But cannot traverse back in Single LL?? Use Stack
***** Traverse each LL, store address in a stack
***** Then compare two stacks, whenever the address differ, that location is the *intersection*
**** Suppose our LL1 and LL2 has the following address
***** LL1: length 8 
      | Data | Address |
      |------+---------|
      |    8 |     100 |
      |    6 |     110 |
      |    3 |     130 |
      |    9 |     150 |
      |   *10* |     *200* |
      |    4 |     220 |
      |    2 |     240 |
      |   12 |     260 |
***** LL2: length 7
      | Data | Address |
      |------+---------|
      |   20 |     300 |
      |   30 |     310 |
      |   40 |     330 |
      |   *10* |     *200* |
      |    4 |     220 |
      |    2 |     240 |
      |   12 |     260 |
***** Record address in a stack. *Note*: first address goes to bottom:
      | Stack 1 | Stack 2 |
      |---------+---------|
      |     260 |     260 |
      |     240 |     240 |
      |     220 |     220 |
      |     *200* |     *200* |
      |     150 |     330 |
      |     130 |     310 |
      |     110 |     300 |
      |     100 |         |
****** Comparing the two stacks, pops out an address, if same, delete
****** Keep track of the previous address that we pop out.
       | Stack 1 | Stack 2 |
       |---------+---------|
       |     260 |     260 |
       |     240 |     240 |
       |     220 |     220 |
       |     200 |     200 |
       |     *150* |     *330* |
       |     130 |     310 |
       |     110 |     300 |
       |     100 |         |
****** Addresses *150* and *330* are different => The intersection is the node before 
****** i,e, node with address 200, which contains data *10*
** Sparse matrix using LL
*** Suppose we have the following matrix 5 x 6
    
    | . | / | *0* | *1* | *2* | *3* | *4* | *5* |
    |---+---+---+---+---+---+---+---|
    | *0* | / | 0 | 0 | 0 | 0 | 8 | 0 |
    | *1* | / | 0 | 0 | 0 | 7 | 0 | 0 |
    | *2* | / | 5 | 0 | 0 | 0 | 9 | 0 |
    | *3* | / | 0 | 0 | 0 | 0 | 0 | 3 |
    | *4* | / | 6 | 0 | 0 | 4 | 0 | 0 |
    
*** We want to *AVOID STORING ZEROES*
*** Coordinate, for number 7 is at (1,3) 1st row, 3rd column
*** For each row, we represent the non zero as an LL. Eg:
**** *Row 0*: |-4-|-8-|-NULL-|
***** Row 0 has element at 4th column, data is 8, it has no other, so pointer next is NULL
**** *Row 1*: |-3-|-7-|-NULL-|
**** *Row 2*: |-0-|-5-|------| --> |-4-|-9-|-NULL-|  
***** Here Row 2 at 0th column has element 5, there is also element 9 at 4th column, so *next* point to this. 
**** *Row 3*: |-5-|-3-|-NULL-|
**** *Row 4*: |-0-|-6-|------| --> |-3-|-4-|-NULL-|
*** This is called an *ARRAY OF LINKED LIST*  
*** So, the Node structure contains: *Column*, *Value*, *Next*
*** To make this structure in C:
    #+ATTR_LATEX: :OPTIONS FRAME=SINGLE
    #+BEGIN_SRC C 
      struct Node
      {
	int col;
	int val;
	struct Node *next;
      };
    #+END_SRC
    >
*** We need the number of row, so we can create an array of size row
*** In our example, we have 5 rows x 6 cols. Generalized to m x n matrix, where *m = 5*
    #+ATTR_LATEX: :OPTIONS FRAME=SINGLE
    #+BEGIN_SRC C
      /* Create array of size m */
      Node *A[m];

      /* For each row, we create a new node */
      A[0] = new Node;
    #+END_SRC
    >
** Polynomial representations
*** Consider: P(x) = 4x^3 + 9x^2 + 6x + 7
*** We will construct each term as a node that has: coefficient, exponent and next pointer
    #+ATTR_LATEX: :options frame=single
    #+begin_src C
      struct Node
      {
	int coeff;
	int exp;
	struct Node *next;
      };
    #+end_src

* Codes
** Implement in C: file:linkedlistBasic.c
** Implement in C++: file:linkedlistBasic.cpp
** Circular linkedlist in C: file:circularLinkedList.c
** Circular Doubly LinkedList in C: file:circularDoubly.c
** Doubly linkedlist in C: file:doubleLinkedList.c
** Student challenge intersection: file:challengeIntersection.c
** Student challenge middle node: [[file:challengeMiddle.c][findMiddle]]
** Student challenge sparse matrix: [[file:challengeSparseMatrix.c][sparseMatrix]]
** Student challenge: [[file:challengePolynomial.c][polynomialLinkedList]]
** Basic Stack implementation: [[file:stackBasic.c][stackBasic]]

