MasteringDataAlgoCpp/LINKED_LIST/linkedlist.tex
\subsubsection{Reverse}
\label{sec:orge979e23}
\begin{enumerate}
\item Display
\label{sec:orgecffd58}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = first;

while (p != NULL) {
  printf("%d\n", p->data);
  p = p->next

    }

\end{minted}
\item Reverse
\label{sec:org2994a66}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
p = first;

while (p != NULL) {
  temp = p->next;
  p->next = p->prev;
  p->prev = temp;
  p = p->prev;
 }

/* for last node, bring first there */
if (p!= NULL && p->next == NULL) {
  first = p;
 }
\end{minted}
\end{enumerate}
\subsubsection{Circular}
\label{sec:orga5fdc57}
\begin{enumerate}
\item Insert
\label{sec:org6ddbdab}
\item Display
\label{sec:org1a08351}
\end{enumerate}
\section{Comparing different linkedlists}
\label{sec:orgeadd123}
\subsection{Space: Doubly takes double the amount of pointers in Singly}
\label{sec:org790e75b}
\subsection{Insert: constant time for Linear Singly, Linear Doubly, Circular Doubly.  Nth time for Circular Singly}
\label{sec:orgdc31ba7}
\section{Array vs Linkedlist}
\label{sec:org4243f89}
\subsection{Creation: array in stack or heap, LL is always on heap}
\label{sec:org91664ed}
\subsection{Size: array fixed, LL can grow until heap is full}
\label{sec:org2735d81}
\subsection{LL takes extra space}
\label{sec:org12eaf87}
\subsection{Array access directly (faster), LL access sequentially (slower)}
\label{sec:org8648808}
\subsection{Data movement in array is more expensive}
\label{sec:org77f3087}
\section{Student challenge}
\label{sec:org9ce48c7}
\subsection{Find middle node of LL}
\label{sec:org1859bc3}
\subsubsection{1st solution}
\label{sec:org43d2c11}
\begin{enumerate}
\item find length of LL => say 7
\label{sec:org9c7e133}
\item reach middle node => 7/2 \textasciitilde{} 4
\label{sec:orga1ee2a1}
\item move the pointer 4-1 times
\label{sec:orga9cc77e}
\end{enumerate}
\subsubsection{2nd solution}
\label{sec:orgcd2f2fa}
\begin{enumerate}
\item use 2 pointers, 1 move 2 space, other move 1 space
\label{sec:orgd983d03}
\end{enumerate}
\subsubsection{3rd solution}
\label{sec:org5e3de2e}
\begin{enumerate}
\item push each node to a stack
\label{sec:org2aa645a}
\item pop out the node at stack number floor(stack size / 2)
\label{sec:org1e47d16}
\end{enumerate}
\subsection{Find intersection of 2 LL}
\label{sec:org4b0ac86}
\subsubsection{Eg: LL1->LL3 and LL2->LL3 => Both LL1 and LL2 has LL3 as common. For example:}
\label{sec:org2de5f6f}
\begin{enumerate}
\item LL1: 8->6->3->9->10->4->2->12
\label{sec:org8bc06fc}
\item LL2: 20->30->40->10->4->2->12
\label{sec:orgfc82715}
\end{enumerate}
\subsubsection{We need to find the starting common point, i.e. block \textbf{10}?}
\label{sec:orgd373bf9}
\begin{enumerate}
\item We traverse the 1st LL or 2nd LL till the end.
\label{sec:org6f3a0f7}
\item Then from end, we traverse back, if the previous block is different,
\label{sec:org3de246d}
\item then current block is \textbf{intersection point}
\label{sec:orge3c6257}
\item But cannot traverse back in Single LL?? Use Stack
\label{sec:orgb53a5a5}
\begin{enumerate}
\item Traverse each LL, store address in a stack
\label{sec:orgb6e3c44}
\item Then compare two stacks, whenever the address differ, that location is the \textbf{intersection}
\label{sec:org1af893e}
\end{enumerate}
\item Suppose our LL1 and LL2 has the following address
\label{sec:orgbc54f56}
\begin{enumerate}
\item LL1: length 8
\label{sec:orgba92eef}
\begin{center}
\begin{tabular}{rr}
Data & Address\\
\hline
8 & 100\\
6 & 110\\
3 & 130\\
9 & 150\\
\textbf{10} & \textbf{200}\\
4 & 220\\
2 & 240\\
12 & 260\\
\end{tabular}
\end{center}
\item LL2: length 7
\label{sec:org1a4a35c}
\begin{center}
\begin{tabular}{rr}
Data & Address\\
\hline
20 & 300\\
30 & 310\\
40 & 330\\
\textbf{10} & \textbf{200}\\
4 & 220\\
2 & 240\\
12 & 260\\
\end{tabular}
\end{center}
\item Record address in a stack. \textbf{Note}: first address goes to bottom:
\label{sec:org625d9af}
\begin{center}
\begin{tabular}{rr}
Stack 1 & Stack 2\\
\hline
260 & 260\\
240 & 240\\
220 & 220\\
\textbf{200} & \textbf{200}\\
150 & 330\\
130 & 310\\
110 & 300\\
100 & \\
\end{tabular}
\end{center}
\begin{enumerate}
\item Comparing the two stacks, pops out an address, if same, delete
\label{sec:org18327d5}
\item Keep track of the previous address that we pop out.
\label{sec:orge74f13c}
\begin{center}
\begin{tabular}{rr}
Stack 1 & Stack 2\\
\hline
260 & 260\\
240 & 240\\
220 & 220\\
200 & 200\\
\textbf{150} & \textbf{330}\\
130 & 310\\
110 & 300\\
100 & \\
\end{tabular}
\end{center}
\item Addresses \textbf{150} and \textbf{330} are different => The intersection is the node before
\label{sec:org859a04f}
\item i,e, node with address 200, which contains data \textbf{10}
\label{sec:orgae1a587}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{Sparse matrix using LL}
\label{sec:org076b9bd}
\subsubsection{Suppose we have the following matrix 5 x 6}
\label{sec:org19e9da1}

\begin{center}
\begin{tabular}{llrrrrrr}
. & / & \textbf{0} & \textbf{1} & \textbf{2} & \textbf{3} & \textbf{4} & \textbf{5}\\
\hline
\textbf{0} & / & 0 & 0 & 0 & 0 & 8 & 0\\
\textbf{1} & / & 0 & 0 & 0 & 7 & 0 & 0\\
\textbf{2} & / & 5 & 0 & 0 & 0 & 9 & 0\\
\textbf{3} & / & 0 & 0 & 0 & 0 & 0 & 3\\
\textbf{4} & / & 6 & 0 & 0 & 4 & 0 & 0\\
\end{tabular}
\end{center}

\subsubsection{We want to \textbf{AVOID STORING ZEROES}}
\label{sec:org67a387f}
\subsubsection{Coordinate, for number 7 is at (1,3) 1st row, 3rd column}
\label{sec:org0894341}
\subsubsection{For each row, we represent the non zero as an LL. Eg:}
\label{sec:orgb5c42d9}
\begin{enumerate}
\item \textbf{Row 0}: |-4-|-8-|-NULL-|
\label{sec:org149fd4d}
\begin{enumerate}
\item Row 0 has element at 4th column, data is 8, it has no other, so pointer next is NULL
\label{sec:orgdbd4faf}
\end{enumerate}
\item \textbf{Row 1}: |-3-|-7-|-NULL-|
\label{sec:orge577ccc}
\item \textbf{Row 2}: |-0-|-5-|------| --> |-4-|-9-|-NULL-|
\label{sec:orgc56a758}
\begin{enumerate}
\item Here Row 2 at 0th column has element 5, there is also element 9 at 4th column, so \textbf{next} point to this.
\label{sec:org54205dc}
\end{enumerate}
\item \textbf{Row 3}: |-5-|-3-|-NULL-|
\label{sec:org2337b2e}
\item \textbf{Row 4}: |-0-|-6-|------| --> |-3-|-4-|-NULL-|
\label{sec:org16cf40b}
\end{enumerate}
\subsubsection{This is called an \textbf{ARRAY OF LINKED LIST}}
\label{sec:org16903be}
\subsubsection{So, the Node structure contains: \textbf{Column}, \textbf{Value}, \textbf{Next}}
\label{sec:org412f958}
\subsubsection{To make this structure in C:}
\label{sec:orgaccd75b}
\begin{minted}[breaklines=true,breakanywhere=true]{c}
struct Node
{
  int col;
  int val;
  struct Node *next;
};
\end{minted}
>
\subsubsection{We need the number of row, so we can create an array of size row}
\label{sec:orge25f273}
\subsubsection{In our example, we have 5 rows x 6 cols. Generalized to m x n matrix, where \textbf{m = 5}}
\label{sec:org837e5a4}
\begin{minted}[breaklines=true,breakanywhere=true]{c}
/* Create array of size m */
Node *A[m];

/* For each row, we create a new node */
A[0] = new Node;
\end{minted}
>
\subsection{Polynomial representations}
\label{sec:org7567c28}
\subsubsection{Consider: P(x) = 4x\textsuperscript{3} + 9x\textsuperscript{2} + 6x + 7}
\label{sec:org3248fdd}
\subsubsection{We will construct each term as a node that has: coefficient, exponent and next pointer}
\label{sec:orgab3ab9e}
\begin{minted}[breaklines=true,breakanywhere=true,frame=single]{c}
struct Node
{
  int coeff;
  int exp;
  struct Node *next;
};
\end{minted}

\section{Codes}
\label{sec:orga9faf18}
\subsection{Implement in C: \url{linkedlistBasic.c}}
\label{sec:org15c7456}
\subsection{Implement in C++: \url{linkedlistBasic.cpp}}
\label{sec:org430279c}
\subsection{Circular linkedlist in C: \url{circularLinkedList.c}}
\label{sec:orgc4f225e}
\subsection{Circular Doubly LinkedList in C: \url{circularDoubly.c}}
\label{sec:orga1bb137}
\subsection{Doubly linkedlist in C: \url{doubleLinkedList.c}}
\label{sec:org0a3748e}
\subsection{Student challenge intersection: \url{challengeIntersection.c}}
\label{sec:org170efd2}
\subsection{Student challenge middle node: \href{challengeMiddle.c}{findMiddle}}
\label{sec:orga82ad44}
\subsection{Student challenge sparse matrix: \href{challengeSparseMatrix.c}{sparseMatrix}}
\label{sec:org84c2f4a}
\subsection{Basic Stack implementation: \href{stackBasic.c}{stackBasic}}
\label{sec:orgee6b159}
\end{document}